## Plan Result (parser-graphql-wrapper-cdk)

[CI link](https://circleci.com/gh/Pocket/pocket-monorepo/155413)


### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!


<pre><code>Plan: 4 to add, 0 to change, 3 to destroy.</code></pre>

* Create
  * aws_elasticache_replication_group.redis_elasticache_replication_group_6DE00446
  * aws_elasticache_subnet_group.redis_elasticache_subnet_group_EA2B92B2
  * aws_security_group.redis_elasticache_security_group_24BFB83E
* Delete
  * aws_elasticache_serverless_cache.serverless_redis_v2_elasticache_serverless_6AA48CC1
  * aws_security_group.serverless_redis_v2_elasticache_security_group_668D35F4
* Replace
  * aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4



<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4 must be replaced
-/+ resource "aws_ecs_task_definition" "application_ecs_service_ecs-task_461CC9D4" {
      ~ arn                      = "arn:aws:ecs:us-east-1:996905175585:task-definition/ParserGraphQLWrapper-Prod:865" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-1:996905175585:task-definition/ParserGraphQLWrapper-Prod" -> (known after apply)
      ~ container_definitions    = jsonencode(
            [
              - {
                  - cpu                    = 0
                  - environment            = [
                      - {
                          - name  = "ENVIRONMENT"
                          - value = "production"
                        },
                      - {
                          - name  = "OTLP_COLLECTOR_HOST"
                          - value = "localhost"
                        },
                      - {
                          - name  = "REDIS_IS_CLUSTER"
                          - value = "true"
                        },
                      - {
                          - name  = "REDIS_IS_TLS"
                          - value = "true"
                        },
                      - {
                          - name  = "REDIS_PRIMARY_ENDPOINT"
                          - value = "parsergraphqlwrapper-prod-serverless-v2-zcx42u.serverless.use1.cache.amazonaws.com"
                        },
                      - {
                          - name  = "REDIS_READER_ENDPOINT"
                          - value = "parsergraphqlwrapper-prod-serverless-v2-zcx42u.serverless.use1.cache.amazonaws.com"
                        },
                    ]
                  - essential              = true
                  - healthCheck            = {
                      - command     = [
                          - "CMD-SHELL",
                          - "curl -f http://localhost:4001/.well-known/apollo/server-health || exit 1",
                        ]
                      - interval    = 5
                      - retries     = 3
                      - startPeriod = 30
                      - timeout     = 5
                    }
                  - image                  = "996905175585.dkr.ecr.us-east-1.amazonaws.com/parsergraphqlwrapper-prod-app:latest"
                  - logConfiguration       = {
                      - logDriver     = "awslogs"
                      - options       = {
                          - awslogs-group             = "/Backend/ParserGraphQLWrapper-Prod/ecs/app"
                          - awslogs-multiline-pattern = "^\\S.+"
                          - awslogs-region            = "us-east-1"
                          - awslogs-stream-prefix     = "ecs"
                        }
                      - secretOptions = []
                    }
                  - mountPoints            = []
                  - name                   = "app"
                  - portMappings           = [
                      - {
                          - containerPort = 4001
                          - hostPort      = 4001
                          - protocol      = "tcp"
                        },
                    ]
                  - readonlyRootFilesystem = false
                  - secrets                = [
                      - {
                          - name      = "CHARACTER_MAP"
                          - valueFrom = "arn:aws:secretsmanager:us-east-1:996905175585:secret:Shared/IntMask:characterMap::"
                        },
                      - {
                          - name      = "DB_HOST"
                          - valueFrom = "arn:aws:secretsmanager:us-east-1:996905175585:secret:ParserGraphQLWrapper/Prod/READITLA_DB:host::"
                        },
                      - {
                          - name      = "DB_PASSWORD"
                          - valueFrom = "arn:aws:secretsmanager:us-east-1:996905175585:secret:ParserGraphQLWrapper/Prod/READITLA_DB:password::"
                        },
                      - {
                          - name      = "DB_USERNAME"
                          - valueFrom = "arn:aws:secretsmanager:us-east-1:996905175585:secret:ParserGraphQLWrapper/Prod/READITLA_DB:username::"
                        },
                      - {
                          - name      = "LETTER_INDEX"
                          - valueFrom = "arn:aws:secretsmanager:us-east-1:996905175585:secret:Shared/IntMask:letterIndex::"
                        },
                      - {
                          - name      = "MD5_RANDOMIZER"
                          - valueFrom = "arn:aws:secretsmanager:us-east-1:996905175585:secret:Shared/IntMask:md5Randomizer::"
                        },
                      - {
                          - name      = "PARSER_URL"
                          - valueFrom = "arn:aws:secretsmanager:us-east-1:996905175585:secret:ParserWrapperApi/Prod/SECRETS:parser_endpoint::"
                        },
                      - {
                          - name      = "POCKET_SHARES_DATABASE_WRITE_HOST"
                          - valueFrom = "arn:aws:secretsmanager:us-east-1:996905175585:secret:ParserWrapperApi/Prod/POCKET_SHARES:host::"
                        },
                      - {
                          - name      = "POCKET_SHARES_DATABASE_WRITE_PASSWORD"
                          - valueFrom = "arn:aws:secretsmanager:us-east-1:996905175585:secret:ParserWrapperApi/Prod/POCKET_SHARES:password::"
                        },
                      - {
                          - name      = "POCKET_SHARES_DATABASE_WRITE_USER"
                          - valueFrom = "arn:aws:secretsmanager:us-east-1:996905175585:secret:ParserWrapperApi/Prod/POCKET_SHARES:username::"
                        },
                      - {
                          - name      = "POSITION_MAP"
                          - valueFrom = "arn:aws:secretsmanager:us-east-1:996905175585:secret:Shared/IntMask:positionMap::"
                        },
                      - {
                          - name      = "SALT_1"
                          - valueFrom = "arn:aws:secretsmanager:us-east-1:996905175585:secret:Shared/IntMask:salt1::"
                        },
                      - {
                          - name      = "SALT_2"
                          - valueFrom = "arn:aws:secretsmanager:us-east-1:996905175585:secret:Shared/IntMask:salt2::"
                        },
                      - {
                          - name      = "SENTRY_DSN"
                          - valueFrom = "arn:aws:ssm:us-east-1:996905175585:parameter/ParserGraphQLWrapper/Prod/SENTRY_DSN"
                        },
                      - {
                          - name      = "SHORT_CODE_CHARS"
                          - valueFrom = "arn:aws:secretsmanager:us-east-1:996905175585:secret:ParserWrapperApi/Prod/SECRETS:short_code_chars::"
                        },
                      - {
                          - name      = "SHORT_PREFIX"
                          - valueFrom = "arn:aws:secretsmanager:us-east-1:996905175585:secret:ParserWrapperApi/Prod/SECRETS:short_prefix::"
                        },
                      - {
                          - name      = "SHORT_PREFIX_SECURE"
                          - valueFrom = "arn:aws:secretsmanager:us-east-1:996905175585:secret:ParserWrapperApi/Prod/SECRETS:short_prefix_secure::"
                        },
                      - {
                          - name      = "UNLEASH_ENDPOINT"
                          - valueFrom = "arn:aws:ssm:us-east-1:996905175585:parameter/Shared/Prod/UNLEASH_ENDPOINT"
                        },
                      - {
                          - name      = "UNLEASH_KEY"
                          - valueFrom = "arn:aws:secretsmanager:us-east-1:996905175585:secret:ParserGraphQLWrapper/Prod/UNLEASH_KEY"
                        },
                    ]
                  - systemControls         = []
                  - volumesFrom            = []
                },
              - {
                  - command                = [
                      - "--config=/etc/ecs/ecs-xray.yaml",
                    ]
                  - cpu                    = 0
                  - environment            = []
                  - essential              = true
                  - image                  = "amazon/aws-otel-collector"
                  - logConfiguration       = {
                      - logDriver     = "awslogs"
                      - options       = {
                          - awslogs-group             = "/Backend/ParserGraphQLWrapper-Prod/ecs/aws-otel-collector"
                          - awslogs-multiline-pattern = "^\\S.+"
                          - awslogs-region            = "us-east-1"
                          - awslogs-stream-prefix     = "ecs"
                        }
                      - secretOptions = []
                    }
                  - mountPoints            = []
                  - name                   = "aws-otel-collector"
                  - portMappings           = [
                      - {
                          - containerPort = 4138
                          - hostPort      = 4138
                          - protocol      = "tcp"
                        },
                      - {
                          - containerPort = 4137
                          - hostPort      = 4137
                          - protocol      = "tcp"
                        },
                    ]
                  - readonlyRootFilesystem = false
                  - repositoryCredentials  = {
                      - credentialsParameter = "arn:aws:secretsmanager:us-east-1:996905175585:secret:Shared/DockerHub"
                    }
                  - systemControls         = []
                  - volumesFrom            = []
                },
            ] # forces replacement
        ) -> (known after apply) # forces replacement
      ~ id                       = "ParserGraphQLWrapper-Prod" -> (known after apply)
      ~ revision                 = 865 -> (known after apply)
        tags                     = {
            "costCenter"  = "Shared"
            "environment" = "Prod"
            "owner"       = "Pocket"
            "service"     = "ParserGraphQLWrapper"
        }
        # (10 unchanged attributes hidden)
    }

  # aws_elasticache_replication_group.redis_elasticache_replication_group_6DE00446 will be created
  + resource "aws_elasticache_replication_group" "redis_elasticache_replication_group_6DE00446" {
      + apply_immediately              = true
      + arn                            = (known after apply)
      + at_rest_encryption_enabled     = (known after apply)
      + auth_token_update_strategy     = "ROTATE"
      + auto_minor_version_upgrade     = (known after apply)
      + automatic_failover_enabled     = true
      + cluster_enabled                = (known after apply)
      + configuration_endpoint_address = (known after apply)
      + data_tiering_enabled           = (known after apply)
      + description                    = "parsergraphqlwrapper-prod-reserved | Managed by terraform"
      + engine                         = "redis"
      + engine_version                 = "7.0"
      + engine_version_actual          = (known after apply)
      + global_replication_group_id    = (known after apply)
      + id                             = (known after apply)
      + ip_discovery                   = (known after apply)
      + maintenance_window             = (known after apply)
      + member_clusters                = (known after apply)
      + multi_az_enabled               = true
      + network_type                   = (known after apply)
      + node_type                      = "cache.m6g.large"
      + num_cache_clusters             = 2
      + num_node_groups                = (known after apply)
      + parameter_group_name           = "default.redis7"
      + port                           = 6379
      + primary_endpoint_address       = (known after apply)
      + reader_endpoint_address        = (known after apply)
      + replicas_per_node_group        = (known after apply)
      + replication_group_id           = "parsergraphqlwrapper-prod-reserved"
      + security_group_ids             = (known after apply)
      + security_group_names           = (known after apply)
      + snapshot_window                = (known after apply)
      + subnet_group_name              = "parsergraphqlwrapper-prod-reserved-elasticachesubnetgroup"
      + tags                           = {
          + "costCenter"  = "Shared"
          + "environment" = "Prod"
          + "owner"       = "Pocket"
          + "service"     = "ParserGraphQLWrapper"
        }
      + tags_all                       = {
          + "costCenter"  = "Shared"
          + "environment" = "Prod"
          + "owner"       = "Pocket"
          + "service"     = "ParserGraphQLWrapper"
        }
      + transit_encryption_enabled     = (known after apply)
    }

  # aws_elasticache_serverless_cache.serverless_redis_v2_elasticache_serverless_6AA48CC1 will be destroyed
  # (because aws_elasticache_serverless_cache.serverless_redis_v2_elasticache_serverless_6AA48CC1 is not in configuration)
  - resource "aws_elasticache_serverless_cache" "serverless_redis_v2_elasticache_serverless_6AA48CC1" {
      - arn                      = "arn:aws:elasticache:us-east-1:996905175585:serverlesscache:parsergraphqlwrapper-prod-serverless-v2" -> null
      - create_time              = "2024-04-10T02:58:23Z" -> null
      - daily_snapshot_time      = "03:00" -> null
      - description              = "Redis for ParserGraphQLWrapper-Prod-serverless-v2" -> null
      - endpoint                 = [
          - {
              - address = "parsergraphqlwrapper-prod-serverless-v2-zcx42u.serverless.use1.cache.amazonaws.com"
              - port    = 6379
            },
        ] -> null
      - engine                   = "redis" -> null
      - full_engine_version      = "7.1" -> null
      - id                       = "parsergraphqlwrapper-prod-serverless-v2" -> null
      - major_engine_version     = "7" -> null
      - name                     = "parsergraphqlwrapper-prod-serverless-v2" -> null
      - reader_endpoint          = [
          - {
              - address = "parsergraphqlwrapper-prod-serverless-v2-zcx42u.serverless.use1.cache.amazonaws.com"
              - port    = 6380
            },
        ] -> null
      - security_group_ids       = [
          - "sg-0f36079bc43a7de83",
        ] -> null
      - snapshot_retention_limit = 0 -> null
      - status                   = "available" -> null
      - subnet_ids               = [
          - "subnet-610bdb3b",
          - "subnet-b2a036fa",
          - "subnet-cc66bde0",
        ] -> null
      - tags                     = {
          - "costCenter"  = "Shared"
          - "environment" = "Prod"
          - "owner"       = "Pocket"
          - "service"     = "ParserGraphQLWrapper"
        } -> null
      - tags_all                 = {
          - "costCenter"  = "Shared"
          - "environment" = "Prod"
          - "owner"       = "Pocket"
          - "service"     = "ParserGraphQLWrapper"
        } -> null

      - cache_usage_limits {
          - data_storage {
              - maximum = 7 -> null
              - unit    = "GB" -> null
            }
        }
    }

  # aws_elasticache_subnet_group.redis_elasticache_subnet_group_EA2B92B2 will be created
  + resource "aws_elasticache_subnet_group" "redis_elasticache_subnet_group_EA2B92B2" {
      + arn         = (known after apply)
      + description = "Managed by Terraform"
      + id          = (known after apply)
      + name        = "parsergraphqlwrapper-prod-reserved-elasticachesubnetgroup"
      + subnet_ids  = [
          + "subnet-610bdb3b",
          + "subnet-b2a036fa",
          + "subnet-cc66bde0",
          + "subnet-d09eb8ec",
        ]
      + tags        = {
          + "costCenter"  = "Shared"
          + "environment" = "Prod"
          + "owner"       = "Pocket"
          + "service"     = "ParserGraphQLWrapper"
        }
      + tags_all    = {
          + "costCenter"  = "Shared"
          + "environment" = "Prod"
          + "owner"       = "Pocket"
          + "service"     = "ParserGraphQLWrapper"
        }
      + vpc_id      = (known after apply)
    }

  # aws_security_group.redis_elasticache_security_group_24BFB83E will be created
  + resource "aws_security_group" "redis_elasticache_security_group_24BFB83E" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "172.16.0.0/16",
                ]
              + description      = ""
              + from_port        = 6379
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 6379
            },
        ]
      + name                   = (known after apply)
      + name_prefix            = "ParserGraphQLWrapper-Prod-reserved"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "costCenter"  = "Shared"
          + "environment" = "Prod"
          + "owner"       = "Pocket"
          + "service"     = "ParserGraphQLWrapper"
        }
      + tags_all               = {
          + "costCenter"  = "Shared"
          + "environment" = "Prod"
          + "owner"       = "Pocket"
          + "service"     = "ParserGraphQLWrapper"
        }
      + vpc_id                 = "vpc-867638e3"
    }

  # aws_security_group.serverless_redis_v2_elasticache_security_group_668D35F4 will be destroyed
  # (because aws_security_group.serverless_redis_v2_elasticache_security_group_668D35F4 is not in configuration)
  - resource "aws_security_group" "serverless_redis_v2_elasticache_security_group_668D35F4" {
      - arn                    = "arn:aws:ec2:us-east-1:996905175585:security-group/sg-0f36079bc43a7de83" -> null
      - description            = "Managed by Terraform" -> null
      - egress                 = [] -> null
      - id                     = "sg-0f36079bc43a7de83" -> null
      - ingress                = [
          - {
              - cidr_blocks      = [
                  - "172.16.0.0/16",
                ]
              - description      = ""
              - from_port        = 6379
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 6379
            },
        ] -> null
      - name                   = "ParserGraphQLWrapper-Prod-serverless-v220240410025821749600000001" -> null
      - name_prefix            = "ParserGraphQLWrapper-Prod-serverless-v2" -> null
      - owner_id               = "996905175585" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {
          - "costCenter"  = "Shared"
          - "environment" = "Prod"
          - "owner"       = "Pocket"
          - "service"     = "ParserGraphQLWrapper"
        } -> null
      - tags_all               = {
          - "costCenter"  = "Shared"
          - "environment" = "Prod"
          - "owner"       = "Pocket"
          - "service"     = "ParserGraphQLWrapper"
        } -> null
      - vpc_id                 = "vpc-867638e3" -> null
    }

Plan: 4 to add, 0 to change, 3 to destroy.

Changes to Outputs:
  ~ ecs-task-arn           = "arn:aws:ecs:us-east-1:996905175585:task-definition/ParserGraphQLWrapper-Prod:865" -> (known after apply)
```

</details>









<!-- github-comment: {"Command":"plan","JobID":"e54762c9-81e4-4e90-846f-23bb064c12f4","JobName":"parser-graphql-wrapper_infrastructure_plan_prod","PRNumber":487,"Program":"tfcmt","SHA1":"1f49fccade2bd16a739a5ba863d51cf79b24ccd5","Target":"parser-graphql-wrapper-cdk","Vars":{}} -->